# Reading Data From Various Data Source

In [7]:
import pandas as pd
from io import StringIO
Data = '{"employee_name": "James", "email": "james@gmail.com", "job_profile": [{"title1":"Team Lead", "title2":"Sr. Developer"}]}'
df=pd.read_json(StringIO(Data))
df

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [8]:
df.to_json()

'{"employee_name":{"0":"James"},"email":{"0":"james@gmail.com"},"job_profile":{"0":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [9]:
df.to_json(orient='records')

'[{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}]'

In [14]:
df = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data", header = None)

In [15]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [16]:
df.to_csv('wine_data.csv')

In [25]:
pip install lxml

Requirement already satisfied: lxml in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (6.0.2)
Note: you may need to restart the kernel to use updated packages.

In [23]:
pip install html5lib

Requirement already satisfied: html5lib in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (1.1)
Requirement already satisfied: six>=1.9 in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (from html5lib) (1.17.0)
Requirement already satisfied: webencodings in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (from html5lib) (0.5.1)
Note: you may need to restart the kernel to use updated packages.

In [24]:
pip install beautifulsoup4

Requirement already satisfied: beautifulsoup4 in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (4.14.3)
Requirement already satisfied: soupsieve>=1.6.1 in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (from beautifulsoup4) (2.8)
Requirement already satisfied: typing-extensions>=4.0.0 in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (from beautifulsoup4) (4.15.0)
Note: you may need to restart the kernel to use updated packages.

In [26]:
url="https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/"

df=pd.read_html(url)

In [27]:
df[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
5,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
6,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
7,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
8,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
9,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
10,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
11,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
12,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535
13,City National Bank of New Jersey,Newark,New Jersey,21111,Industrial Bank,"November 1, 2019",10534
14,Resolute Bank,Maumee,Ohio,58317,Buckeye State Bank,"October 25, 2019",10533
15,Louisa Community Bank,Louisa,Kentucky,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
16,The Enloe State Bank,Cooper,Texas,10716,"Legend Bank, N. A.","May 31, 2019",10531
17,Washington Federal Bank for Savings,Chicago,Illinois,30570,Royal Savings Bank,"December 15, 2017",10530
18,The Farmers and Merchants State Bank of Argonia,Argonia,Kansas,17719,Conway Bank,"October 13, 2017",10529
19,Fayette County Bank,Saint Elmo,Illinois,1802,"United Fidelity Bank, fsb","May 26, 2017",10528
20,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,Wisconsin,30003,First-Citizens Bank & Trust Company,"May 5, 2017",10527
21,First NBC Bank,New Orleans,Louisiana,58302,Whitney Bank,"April 28, 2017",10526
22,Proficio Bank,Cottonwood Heights,Utah,35495,Cache Valley Bank,"March 3, 2017",10525
23,Seaway Bank and Trust Company,Chicago,Illinois,19328,State Bank of Texas,"January 27, 2017",10524
24,Harvest Community Bank,Pennsville,New Jersey,34951,First-Citizens Bank & Trust Company,"January 13, 2017",10523

In [36]:
pip install requests

Requirement already satisfied: requests in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (2.32.5)
Requirement already satisfied: charset_normalizer<4,>=2 in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (from requests) (3.4.4)
Requirement already satisfied: idna<4,>=2.5 in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (from requests) (3.11)
Requirement already satisfied: urllib3<3,>=1.21.1 in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (from requests) (2.6.2)
Requirement already satisfied: certifi>=2017.4.17 in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (from requests) (2025.11.12)
Note: you may need to restart the kernel to use updated packages.

In [41]:
import requests
url = "https://en.wikipedia.org/wiki/Mobile_country_code"

headers = {
    "User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0 Safari/537.36"
}

html = requests.get(url, headers=headers).text

df = pd.read_html(html, match="Country", header=0)[0]
df.head()

/var/folders/y1/44jbvlv94_5c1bldzjp1gnlh0000gn/T/ipykernel_2569/3788777653.py:10: FutureWarning: Passing literal html to 'read_html' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  df = pd.read_html(html, match="Country", header=0)[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN

In [44]:
pip install openpyxl

Requirement already satisfied: openpyxl in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

In [46]:
df_excel=pd.read_excel('data.xlsx')

In [47]:
df_excel.to_pickle('df_excel')

In [48]:
pd.read_pickle('df_excel')

     Name   Age
0  Vaibhav   21
1  Prashiv   22
2  Saksham   19
3    Purab   20